---
title: Checker
classe: Autodesk.Revit.DB.Visual.Checker
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# Checker

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CheckerColor1 { get; }` | `Checker.CheckerColor1` | String |
| `String CheckerColor2 { get; }` | `Checker.CheckerColor2` | String |
| `String CheckerSoften { get; }` | `Checker.CheckerSoften` | String |
| `String TextureLinkTextureTransforms { get; }` | `Checker.TextureLinkTextureTransforms` | String |
| `String TextureOffsetLock { get; }` | `Checker.TextureOffsetLock` | String |
| `String TextureRealWorldOffsetX { get; }` | `Checker.TextureRealWorldOffsetX` | String |
| `String TextureRealWorldOffsetY { get; }` | `Checker.TextureRealWorldOffsetY` | String |
| `String TextureRealWorldScaleX { get; }` | `Checker.TextureRealWorldScaleX` | String |
| `String TextureRealWorldScaleY { get; }` | `Checker.TextureRealWorldScaleY` | String |
| `String TextureScaleLock { get; }` | `Checker.TextureScaleLock` | String |
| `String TextureURepeat { get; }` | `Checker.TextureURepeat` | String |
| `String TextureVRepeat { get; }` | `Checker.TextureVRepeat` | String |
| `String TextureWAngle { get; }` | `Checker.TextureWAngle` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```